<script lang="ts">
    import { generateImportURL } from "$lib";
    import type { PageData } from "./$types";
    import NavBar from "$lib/NavBar.svelte";

    export let data: PageData;
</script>

<div class="mx-12">
    <NavBar title="{data.font}" />

    <link href={generateImportURL([{ family: data.font }])} rel="stylesheet" />

    <h2 class="my-3">Example Text</h2>
    <div class="preview-text mb-10" style="font-family: '{data.font}', sans-serif;">
        ကုမ္ပဏီကိုယ်တိုင်က အရမ်းအောင်မြင်တဲ့ ကုမ္ပဏီတစ်ခုပါ။ ခံနိုင်ရည်အရှိဆုံး
        အဆင်မပြေမှုတို့သည် အကျိုးရှိငြားအံ့၊ ချော့မော့ခြင်းမှ ပြေးခြင်းကိုမူကား၊
        စည်းဝေးသောသူတို့၏ ပြေးခြင်းသက်သက်ကိုမူကား၊ ရွေးချယ်မှု၊ နှင့်ထိုအရာများ!
        ဒီလိုစွပ်စွဲသူတွေကို ထောက်ပံ့ပေးပေမယ့် ဘယ်သူမှ မပေးဘူး။ အမှန်တရား
        ဗိသုကာပညာရှင်အား အပျော်အပါး နှောက်ယှက်ရန် သူ၏အခွင့်အရေးကြောင့်
        မျက်စိကွယ်သွားမည်ဖြစ်သည်။ ဘာမှမဖြစ်ပါဘူး၊ ဝန်ဆောင်မှုတွေရဲ့ အမှားတစ်ခု
        ဒါမှမဟုတ် တစ်ခုခုဖြစ်သွားလိမ့်မယ်။ ရန်ရှာခြင်းမှ တားဆီးခြင်း၊
        မုန်းတီးခြင်း၊ သူတို့ တစ်ခုခု ကြွေးတင်နေမှန်း သူတို့ မသိလို့ မှားနေတယ်။
        ဝေဖန်ပါ။ ဘာဖြစ်လို့လဲဆိုတော့ ပျံသန်းမှုကို ငြင်းပယ်ခြင်း၏ အမှားသည်
        အဘယ်မှာရှိသနည်း။ သူတို့ဒုက္ခတွေကို ချီးမွမ်းတယ်။ လိမ္မာသောသဘောဖြင့်
        ခံယူရမည်လော။ ဒါပေမယ့် တချို့ကို အခြားအမှားတစ်ခုကတော့ ဒီအရာတွေကို
        အကောင်းဆုံးဖြစ်အောင် ငြင်းဆန်ခြင်းပါပဲ။ ကြည့်ကျတာပေါ့ ငယ်​ငယ်​​လေး​တွေ
        နာကျင်​ရမှန်းမသိဘူး! တရားတော်၏ ကာမဂုဏ်ကို အလိုရှိတိုင်း နှစ်သက်အပ်ကုန်၏။
        ဒါပေမယ့် တချို့အတွက်တော့ ပျော်စရာအချိန်တွေပါပဲ။ ဆင်းရဲခြင်းမှ
        လွတ်မြောက်ပါစေ၊ ဝေဒနာဖြင့် ချည်နှောင်ထား၏။ ကြီးစွာသော
        နူးညံ့သိမ်မွေ့မှုဖြင့် လွတ်မြောက်ခြင်းသို့ ရောက်ပါစေသော ရလဒ်!
        ဤအားသာချက်များထဲမှ အနည်းဆုံးကို ဤနေရာတွင် ငြင်းပယ်ရမည်။ နာကျင်မှု
        ခွင့်လွှတ်ခြင်း၏ အကျိုးကျေးဇူးများနှင့် အခြားအရာများကို ဖြည့်ဆည်းရန်
        သူရှာသည်။ ကာမဂုဏ်တရားတွေ ပေါက်ဖွားလာတာကို မကြာခဏ ရှင်းပြမယ်။ ဝေဒနာကို
        ခံနိုင်ရည်ရှိအောင် လက်ခံလိုစိတ်ထက် ဝေဒနာကို ရွေးချယ်ဖို့ ပြေးပါစေ။
        ဘာယူလဲ။ ကျေးဇူးပြု၍ ဗိသုကာပညာရှင်ကဲ့သို့မဟုတ်ဘဲ၊
        သူ့ကိုချီးမွမ်းသောသူတို့ထံမှ အပျော်အပါးရှာပါစေ။ တစ်ခါတလေမှာ အမှားခံဖို့၊
        ဘယ်တော့မှ ငြင်းလို့မရတဲ့ နည်းလမ်းလေးတွေ ရှိပါတယ်။
        အကြောင်းပြချက်တစ်ခုလုံးသည် ပျော်ရွှင်မှုနှင့် ပျံသန်းခြင်းပင်ဖြစ်သည်။
        သူတို့ထဲက တစ်ခုခုကို လာနိုင်တယ်။ တစ်ခုရွေးရသလိုပဲ၊ သူ့ခန္ဓာကိုယ်ကို
        နှစ်သက်ပါစေ။
    </div>

    <h2 class="my-3">Import Rule</h2>
    <code
        class="text-sm sm:text-base inline-flex text-left items-center space-x-4 bg-gray-800 text-white rounded-lg p-4 pl-6"
    >
        <span class="flex gap-4">
            <span class="flex-1">
                <span>@import url("{generateImportURL([{family: data.font}])}")</span>
            </span>
        </span>
    </code>
</div>

<style>
    .preview-text {
        padding: 2rem;
        border-radius: 6px;
        background: var(--border-color);
    }
</style>
